[
  {
    "Nome": "Sistema de Gestão Escolar",
    "detalhes": "O Sistema de Gestão Escolar foi desenvolvido para gerenciar dados de escolas, com foco na organização e também administração de matrículas, notas e informações sobre os alunos. O sistema permite o gerenciamento eficiente das informações educacionais, além de gerar relatórios e análises para professores, administradores e pais. A plataforma foi projetada com uma interface intuitiva, visando facilitar o uso tanto para profissionais da educação quanto para os estudantes. O sistema foi construído com tecnologias como Java e MySQL, permitindo alta performance e escalabilidade. Também implementamos uma base de dados robusta que garante a segurança e integridade dos dados armazenados, além de uma arquitetura que favorece a fácil manutenção e evolução do sistema ao longo do tempo.",
    "integrantes": ["Bryan Amorim dos Santos", "Carlos Oliveira", "Lucas Mendes", "Mariana Silva", "João Pereira"],
    "tecnologias": ["Java", "MySQL"],
    "ferramentas": ["Git"],
    "Curso": "Engenharia de Software",
    "unidade": "Barra",
    "período": "nono",
    "datainicio": "2023-01-10",
    "datafim": "2024-06-15",
    "Fotodecapa": "imagens/image.png",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "Aplicativo de Entregas",
    "detalhes": "O Aplicativo de Entregas é uma plataforma móvel voltada para o mercado de entregas rápidas, conectando entregadores e clientes de maneira ágil e eficaz. A solução permite que o usuário solicite entregas em tempo real, enquanto os entregadores podem visualizar as solicitações e aceitar aquelas que estejam dentro de sua área de atuação. O app foi desenvolvido utilizando o Flutter, que permite a criação de interfaces responsivas e eficientes em múltiplas plataformas, e o Firebase, garantindo um backend robusto e seguro. A aplicação é capaz de realizar o rastreamento das entregas, fornecer estimativas de tempo, além de permitir a comunicação direta entre cliente e entregador. O sistema também oferece um painel de administração para gerenciar usuários, pagamentos e status das entregas.",
    "integrantes": ["Fernanda Costa", "Thiago Ribeiro", "Juliana Martins", "Ricardo Oliveira", "Gustavo Almeida"],
    "tecnologias": ["Flutter", "Firebase"],
    "ferramentas": ["Postman"],
    "Curso": "Ciência de Dados",
    "unidade": "Centro",
    "período": "quarto",
    "datainicio": "2000-02-01",
    "datafim": "2023-05-20",
    "Fotodecapa": "imagens/old-computer-2.jpg",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "E-commerce de Moda",
    "detalhes": "O E-commerce de Moda é uma plataforma online desenvolvida para a venda de roupas e acessórios, com foco em oferecer uma experiência de compra simples, rápida e segura. A plataforma permite que os usuários façam compras por categoria, tamanho, cor e preço, com um sistema de busca eficiente. A interface foi projetada com o React, garantindo um front-end dinâmico e responsivo. Já o back-end foi desenvolvido com Node.js, que proporciona uma experiência de compra fluida e sem atrasos. O sistema também conta com integração de pagamento, gerenciamento de estoque, envio de notificações e a possibilidade de registrar avaliações de produtos. Além disso, a plataforma permite o cadastro de novos produtos e gerencia automaticamente o estoque com base nas vendas.",
    "integrantes": ["Mariana Souza", "Pedro Ferreira", "Renata Lima", "Carlos Rocha", "Tatiane Gomes"],
    "tecnologias": ["React", "Node.js"],
    "ferramentas": ["Figma"],
    "Curso": "Análise e Desenvolvimento de Sistemas",
    "unidade": "Barra",
    "período": "sétimo",
    "datainicio": "2023-03-15",
    "datafim": "2023-08-30",
    "Fotodecapa": "imagens/old-computer-3.jpg",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "Plataforma de Ensino",
    "detalhes": "A Plataforma de Ensino é uma solução EAD (Educação a Distância) focada em disponibilizar aulas ao vivo, materiais de apoio e interação entre estudantes e professores. Ela foi desenvolvida para facilitar o processo de aprendizagem, proporcionando aos alunos a flexibilidade de estudar de qualquer lugar. A plataforma oferece funcionalidades como videoconferências em tempo real, chat ao vivo, fóruns de discussão e upload de materiais. Utilizando as tecnologias Python e Django, a aplicação tem como objetivo garantir uma alta performance e escalabilidade, atendendo à demanda de diferentes tipos de usuários, desde os que acompanham apenas aulas gravadas até os que participam ativamente de todas as interações ao vivo. Além disso, o sistema conta com uma interface intuitiva e é totalmente responsivo, acessível de qualquer dispositivo móvel.",
    "integrantes": ["Ricardo Alves", "Paula Santana", "João Araújo", "Pedro Costa", "Felipe Almeida"],
    "tecnologias": ["Python", "Django"],
    "ferramentas": ["Slack"],
    "Curso": "Engenharia da Computação",
    "unidade": "Centro",
    "período": "quarto",
    "datainicio": "2023-04-10",
    "datafim": "2023-09-10",
    "Fotodecapa": "imagens/old-computer-4.jpg",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "App de Controle Financeiro",
    "detalhes": "O App de Controle Financeiro é uma solução completa para o gerenciamento das finanças pessoais, permitindo aos usuários controlar receitas, despesas, orçamentos e até realizar projeções financeiras. O aplicativo foi projetado para ser intuitivo, com uma interface amigável que facilita a navegação e o uso por qualquer pessoa, independentemente do seu conhecimento financeiro. Desenvolvido com Kotlin e SQLite, ele oferece um desempenho rápido e eficiente em dispositivos Android. Entre as funcionalidades estão o controle de gastos por categorias, geração de relatórios gráficos, lembretes de pagamento de contas e o acompanhamento de metas financeiras. A plataforma foi criada com o objetivo de ajudar os usuários a melhorarem sua saúde financeira, garantindo mais organização e planejamento no dia a dia.",
    "integrantes": ["Sara Matos", "Leandro Souza", "Felipe Batista", "Tatiane Mendes", "Lucas Oliveira"],
    "tecnologias": ["Kotlin", "SQLite"],
    "ferramentas": ["Trello"],
    "Curso": "Engenharia de Software",
    "unidade": "Barra",
    "período": "sexto",
    "datainicio": "2023-05-20",
    "datafim": "2023-10-01",
    "Fotodecapa": "imagens/image.png",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "Sistema de Gestão de Tarefas",
    "detalhes": "O Sistema de Gestão de Tarefas foi desenvolvido com o objetivo de facilitar o gerenciamento de tarefas individuais e em equipe. A plataforma permite que os usuários criem tarefas, definam prazos e estabeleçam prioridades, além de possibilitar o acompanhamento do andamento das atividades. É ideal para empresas e equipes que buscam otimizar sua produtividade e comunicação. Desenvolvido com Vue.js no front-end e Node.js no back-end, o sistema é escalável e flexível, permitindo integrações futuras com outras ferramentas de produtividade. Além disso, a plataforma conta com funcionalidades como notificações em tempo real, histórico de atividades e relatórios detalhados de desempenho. A interface foi projetada de forma a ser intuitiva e de fácil utilização, garantindo uma experiência agradável para todos os usuários.",
    "integrantes": ["Amanda Nunes", "Gabriel Moura", "Marcelo Lima", "Carla Rodrigues", "Renato Silva"],
    "tecnologias": ["Vue.js", "Node.js"],
    "ferramentas": ["GitHub"],
    "Curso": "Sistemas de Informação",
    "unidade": "Botafogo",
    "período": "oitavo",
    "datainicio": "2023-06-01",
    "datafim": "2023-11-01",
    "Fotodecapa": "imagens/old-computer-1.jpg",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "Sistema de Votação Eletrônica",
    "detalhes": "O Sistema de Votação Eletrônica foi projetado para garantir a segurança e integridade em processos eleitorais, permitindo que votantes realizem seus votos de maneira online e confidencial. A solução integra criptografia avançada e autenticação multifatorial para garantir a veracidade das informações e a proteção contra fraudes. Desenvolvido com tecnologias como Python e Flask, a plataforma foi projetada para ser escalável e de fácil integração com sistemas governamentais existentes. Além disso, o sistema permite a visualização em tempo real dos resultados e oferece um painel administrativo para o acompanhamento das eleições. A segurança é uma das prioridades, com auditoria completa do processo eleitoral e log de cada voto registrado.",
    "integrantes": ["Aline Costa", "Eduardo Almeida", "Carla Martins", "Vitor Souza", "Renan Pereira"],
    "tecnologias": ["Python", "Flask", "PostgreSQL"],
    "ferramentas": ["Docker"],
    "Curso": "Ciência da Computação",
    "unidade": "Centro",
    "período": "oitavo",
    "datainicio": "2023-07-01",
    "datafim": "2023-11-30",
    "Fotodecapa": "imagens/old-computer-1.jpg",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "Plataforma de Caronas",
    "detalhes": "A Plataforma de Caronas tem como objetivo facilitar o compartilhamento de viagens entre motoristas e passageiros. Com foco na sustentabilidade e redução de custos com transporte, o sistema permite que usuários se conectem para oferecer ou solicitar caronas para os mais diversos destinos. Desenvolvido utilizando React Native, o aplicativo é responsivo e permite o cadastro de rotas, horários e preferências dos motoristas e passageiros. Além disso, a plataforma oferece uma funcionalidade de rating para promover a segurança, permitindo que os usuários avaliem uns aos outros após cada viagem. A integração com mapas em tempo real garante um melhor planejamento e segurança durante as caronas.",
    "integrantes": ["Bruna Silva", "Daniel Souza", "Juliana Pereira", "Felipe Gomes", "Marcio Oliveira"],
    "tecnologias": ["React Native", "Firebase"],
    "ferramentas": ["Trello"],
    "Curso": "Tecnologia da Informação",
    "unidade": "Barra",
    "período": "quinto",
    "datainicio": "2023-04-01",
    "datafim": "2023-08-15",
    "Fotodecapa": "imagens/old-computer-3.jpg",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "Gestão de Recursos Humanos",
    "detalhes": "O Sistema de Gestão de Recursos Humanos foi desenvolvido para otimizar o controle de funcionários, desde o processo de recrutamento até a gestão de desempenho e avaliações periódicas. O sistema permite o cadastro e acompanhamento de funcionários, controle de férias, gestão de contratos e análises de performance. A plataforma foi construída com Angular no front-end e Django no back-end, proporcionando uma interface dinâmica e segura. Além disso, o sistema conta com ferramentas de análise de dados que permitem à gestão identificar pontos de melhoria e mapear as necessidades de treinamento para os colaboradores.",
    "integrantes": ["José Almeida", "Carolina Freitas", "Miguel Santos", "Juliana Lacerda", "Rafael Costa"],
    "tecnologias": ["Angular", "Django"],
    "ferramentas": ["Jira"],
    "Curso": "Sistemas de Informação",
    "unidade": "Botafogo",
    "período": "sétimo",
    "datainicio": "2023-06-20",
    "datafim": "2023-10-25",
    "Fotodecapa": "imagens/old-computer-2.jpg",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "Sistema de Reservas de Hotel",
    "detalhes": "O Sistema de Reservas de Hotel foi projetado para facilitar o processo de reservas de acomodações, permitindo que os clientes busquem por hotéis, vejam disponibilidade e façam suas reservas de forma simples e segura. Desenvolvido com JavaScript (React) no front-end e Node.js no back-end, a plataforma é altamente responsiva e permite uma navegação ágil. O sistema integra um banco de dados em MySQL para gerenciar informações sobre quartos, reservas, pagamentos e check-ins. Além disso, conta com uma área de administração para que os donos de hotéis possam gerenciar disponibilidade de quartos, preços e pacotes promocionais. A plataforma também oferece integração com gateways de pagamento e envio de e-mails de confirmação de reservas.",
    "integrantes": ["Rafael Lima", "Mariana Soares", "Vinícius Costa", "Gabriela Barbosa", "Leonardo Moreira"],
    "tecnologias": ["React", "Node.js", "MySQL"],
    "ferramentas": ["GitHub"],
    "Curso": "Engenharia de Software",
    "unidade": "Centro",
    "período": "nono",
    "datainicio": "2023-05-10",
    "datafim": "2023-09-30",
    "Fotodecapa": "imagens/old-computer-4.jpg",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "Sistema de Controle de Estoque",
    "detalhes": "O Sistema de Controle de Estoque foi desenvolvido para ajudar empresas a gerenciar e controlar seu inventário de forma eficiente. A plataforma permite o cadastro de produtos, controle de entradas e saídas de mercadorias, além de gerar relatórios de movimentação de estoque. Utilizando o framework Ruby on Rails, o sistema é altamente escalável e permite integrações com outros sistemas de gestão empresarial. A interface foi projetada para ser simples e fácil de usar, com funcionalidades de alerta de baixo estoque, previsão de compras e relatórios de tendências de consumo. O sistema é ideal para empresas de diferentes tamanhos que buscam otimizar a gestão de seu estoque e reduzir erros manuais.",
    "integrantes": ["Felipe Almeida", "Patrícia Lima", "Igor Silva", "Eduardo Costa", "Daniel Rocha"],
    "tecnologias": ["Ruby on Rails", "PostgreSQL"],
    "ferramentas": ["Slack"],
    "Curso": "Gestão da Tecnologia da Informação",
    "unidade": "Botafogo",
    "período": "sexto",
    "datainicio": "2023-07-15",
    "datafim": "2023-11-05",
    "Fotodecapa": "imagens/old-computer-2.jpg",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "Sistema de Automação Residencial",
    "detalhes": "O Sistema de Automação Residencial foi projetado para oferecer controle inteligente sobre diversos dispositivos em uma casa, como luzes, termostatos, câmeras de segurança e eletrodomésticos. A plataforma permite que os usuários controlem esses dispositivos remotamente via smartphone, além de programar ações automáticas com base em horários ou gatilhos específicos. A solução é baseada em tecnologias como Node.js para a parte de backend e React para o frontend, proporcionando uma interface intuitiva e rápida. O sistema também suporta integração com assistentes virtuais como Alexa e Google Assistant, tornando a automação ainda mais acessível. Com segurança robusta, incluindo criptografia de dados, o sistema garante a proteção das informações dos usuários.",
    "integrantes": ["Felipe Andrade", "Cláudia Silva", "Paulo Henrique", "Simone Oliveira", "Lucas Almeida"],
    "tecnologias": ["Node.js", "React", "MongoDB"],
    "ferramentas": ["Git", "Postman"],
    "Curso": "Engenharia da Computação",
    "unidade": "Barra",
    "período": "oitavo",
    "datainicio": "2023-06-01",
    "datafim": "2023-11-20",
    "Fotodecapa": "imagens/old-computer-1.jpg",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "Plataforma de Aprendizado de Idiomas",
    "detalhes": "A Plataforma de Aprendizado de Idiomas foi criada para ajudar usuários a aprender e praticar novos idiomas de forma interativa e divertida. Com uma abordagem gamificada, o sistema oferece lições de gramática, vocabulário e pronúncia, além de quizzes e desafios que tornam o aprendizado mais dinâmico. A plataforma foi desenvolvida utilizando Vue.js no front-end e Python no back-end, proporcionando uma experiência rápida e interativa. O sistema também conta com funcionalidades de tradução em tempo real e integração com dicionários online. Com um sistema de feedback e avaliações constantes, os usuários podem monitorar seu progresso e identificar áreas de melhoria.",
    "integrantes": ["Joana Pereira", "Carlos Augusto", "Renata Costa", "Lucas Silva", "Patrícia Oliveira"],
    "tecnologias": ["Vue.js", "Python", "SQLite"],
    "ferramentas": ["Slack", "Trello"],
    "Curso": "Sistemas de Informação",
    "unidade": "Centro",
    "período": "sétimo",
    "datainicio": "2023-05-01",
    "datafim": "2023-09-30",
    "Fotodecapa": "imagens/old-computer-2.jpg",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "Aplicativo de Rastreamento de Pedidos",
    "detalhes": "O Aplicativo de Rastreamento de Pedidos foi desenvolvido para facilitar o acompanhamento de compras realizadas online. O app permite que os usuários acompanhem o status de seus pedidos em tempo real, desde o envio até a entrega final. Utilizando o framework Flutter para o desenvolvimento cross-platform e Firebase para o armazenamento de dados, a plataforma oferece uma interface simples e eficiente. Além disso, o sistema envia notificações push para manter os usuários atualizados sobre o status de seus pedidos, e permite o rastreamento em parceria com diversas transportadoras. Com uma arquitetura escalável, o aplicativo pode ser facilmente integrado a lojas virtuais de diferentes portes.",
    "integrantes": ["Juliana Santos", "Carlos Lima", "Ricardo Mendes", "Tatiane Oliveira", "Beatriz Souza"],
    "tecnologias": ["Flutter", "Firebase"],
    "ferramentas": ["Postman"],
    "Curso": "Ciência da Computação",
    "unidade": "Barra",
    "período": "sexto",
    "datainicio": "2023-05-15",
    "datafim": "2023-09-15",
    "Fotodecapa": "imagens/old-computer-3.jpg",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "Sistema de Gestão de Inventário para Restaurantes",
    "detalhes": "O Sistema de Gestão de Inventário para Restaurantes foi desenvolvido para automatizar o controle de estoque de ingredientes e produtos em estabelecimentos do ramo alimentício. O sistema permite que gerentes de restaurantes registrem a entrada e saída de itens, gerenciem a validade dos produtos e criem relatórios detalhados sobre o consumo e reposição de estoque. Utilizando tecnologias como Ruby on Rails para o back-end e React para o front-end, o sistema é altamente intuitivo e fácil de usar. Com a integração de alertas automáticos sobre itens próximos da data de vencimento e funcionalidades de previsão de compras, o sistema busca otimizar a operação e reduzir desperdícios.",
    "integrantes": ["Juliana Costa", "Ricardo Oliveira", "Felipe Almeida", "Amanda Lopes", "Leandro Souza"],
    "tecnologias": ["Ruby on Rails", "React", "PostgreSQL"],
    "ferramentas": ["Git", "Trello"],
    "Curso": "Engenharia de Software",
    "unidade": "Centro",
    "período": "quinto",
    "datainicio": "2023-03-15",
    "datafim": "2023-08-15",
    "Fotodecapa": "imagens/old-computer-4.jpg",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  },
  {
    "Nome": "Sistema de Feedback de Funcionários",
    "detalhes": "O Sistema de Feedback de Funcionários foi desenvolvido para auxiliar empresas no processo de avaliação de desempenho e feedback contínuo para seus colaboradores. O sistema permite que os gestores realizem avaliações periódicas, enviem feedbacks personalizados e acompanhem o desempenho dos funcionários ao longo do tempo. Utilizando a plataforma Angular para o front-end e Java para o back-end, o sistema é rápido e fácil de usar. O sistema oferece funcionalidades como feedback anônimo, análises de desempenho com gráficos e relatórios, e a capacidade de definir metas de desenvolvimento profissional para os colaboradores. A plataforma busca melhorar a comunicação interna e a motivação dos funcionários.",
    "integrantes": ["Ricardo Costa", "Aline Soares", "Joana Silva", "Felipe Almeida", "Paula Mendes"],
    "tecnologias": ["Angular", "Java", "MySQL"],
    "ferramentas": ["JIRA"],
    "Curso": "Gestão de Pessoas",
    "unidade": "Barra",
    "período": "quarto",
    "datainicio": "2023-04-01",
    "datafim": "2023-08-01",
    "Fotodecapa": "imagens/old-computer-1.jpg",
    "fotos": ["imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg", "imagens/old-computer-4.jpg"]
  }
]
